SLS/src/Catalogs/БазыДанных1С/БазыДанных1С.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БазыДанных1С</name>
  <owners>Catalog.Кластеры1СПредприятия</owners>
  <attributes>
    <name>ИмяВКластере</name>
    <comment>Имя информационной базы как оно задано в кластере 1С:Предприятия</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставляемаяКонфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации1С</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаДаннызSQL</name>
    <type>
      <types>CatalogRef.БазыДанныхSQL</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервераПубликации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортПубликации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКПубликацииНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЖурналаИсключений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

SLS/src/Catalogs/ТипыСекретовКонфигураций1С/ТипыСекретовКонфигураций1С.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыСекретовКонфигураций1С</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Конфигурации1С</owners>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимПароля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСчитыватьДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокВывода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

SLS/src/Catalogs/БазыДанных1С/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьОписаниеПараметровДоступа(ПараметрыДоступа) Экспорт
	
	ПараметрДоступа = ПараметрыДоступа.Добавить();
	ПараметрДоступа.Имя = "ИмяСлужебногоПользователя1С";
	ПараметрДоступа.Синоним = "";
	ПараметрДоступа.РежимПароля = Ложь;
	
	ПараметрДоступа = ПараметрыДоступа.Добавить();
	ПараметрДоступа.Имя = "ПарольСлужебногоПользователя1С";
	ПараметрДоступа.Синоним = "";
	ПараметрДоступа.НеСчитыватьДанные = Истина;
	ПараметрДоступа.РежимПароля = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТипыСекретовКонфигураций1С.Наименование КАК Имя,
	|	ТипыСекретовКонфигураций1С.Синоним КАК Синоним,
	|	ТипыСекретовКонфигураций1С.РежимПароля КАК РежимПароля,
	|	ТипыСекретовКонфигураций1С.НеСчитыватьДанные КАК НеСчитыватьДанные
	|ИЗ
	|	Справочник.ТипыСекретовКонфигураций1С КАК ТипыСекретовКонфигураций1С
	|ГДЕ
	|	НЕ ТипыСекретовКонфигураций1С.ЭтоГруппа
	|	И НЕ ТипыСекретовКонфигураций1С.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипыСекретовКонфигураций1С.ПорядокВывода";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПараметрДоступа = ПараметрыДоступа.Добавить();
		ПараметрДоступа.Имя = Выборка.Имя;
		ПараметрДоступа.Синоним = Выборка.Синоним;
		ПараметрДоступа.НеСчитыватьДанные = Выборка.НеСчитыватьДанные;
		ПараметрДоступа.РежимПароля = Выборка.РежимПароля;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
